# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [41]:
# import libraries here
import pandas as pd
import sqlalchemy
import matplotlib.pyplot as plt
%matplotlib inline

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [2]:
# your answer here
url = pd.read_csv("../your-code/Temp_States.csv")
temp = pd.DataFrame(url)

#### Print `temp`

In [3]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [4]:
# your answer here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

#### Select the rows where state is New York

In [7]:
# your answer here
rows_nyc = temp["City"] == "NYC"
temp[rows_nyc]

  City     State  Temperature
0  NYC  New York    19.444444

In [8]:
# your answer here
# conn = pymsql.connect(host = "localhost",
#                     port = 3306,
#                     user = "ironhack"
#                     database = "temp",
#                     password = getpass.getpass())

#engine = create_engine('mysql://scott:tiger@localhost/test')

# query = """"
#        SELECT *
#        FROM temp
#        WHERE City = "NYC"
#        """

# rows_nyc = pd.read_sql(query, conn)

#### What is the average of the temperature of cities in New York?

In [9]:
# your answer here
temp[rows_nyc].describe()

       Temperature
count     1.000000
mean     19.444444
std            NaN
min      19.444444
25%      19.444444
50%      19.444444
75%      19.444444
max      19.444444

#### We want to know cities and states with Temperature above 15 degress Celcius

In [10]:
# your answer here
rows_above15 = temp["Temperature"] > 15.0
temp[rows_nyc & rows_above15]

  City     State  Temperature
0  NYC  New York    19.444444

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [11]:
# your answer here
temp[rows_above15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [13]:
# your answer here
rows_below20 = temp["Temperature"] < 20.0
temp[rows_below20 & rows_above15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [34]:
# your answer here
# temp.groupby("State", axis=1)

drivetrain = pd.get_dummies(temp['State'])
temp[drivetrain]

# DID NOT KNOW HOW TO SOLVE IT

  City State  Temperature
0  NaN   NaN          NaN
1  NaN   NaN          NaN
2  NaN   NaN          NaN
3  NaN   NaN          NaN
4  NaN   NaN          NaN
5  NaN   NaN          NaN
6  NaN   NaN          NaN

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [37]:
# your answer here
url = pd.read_csv("../your-code/employee.csv")
employee = pd.DataFrame(url)
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the Temp dataframe. Comment your results

In [36]:
# your answer here
employee.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

#### Show visually the frequency distribution (histogram) of the employee dataset (Years and Salary, 20 buckets). In few words describe these histograms?

In [52]:
# your answer here
# plt.hist(employee["Years"], employee["Salary"]);

#### What's the average salary in this company?

In [53]:
# your answer here
employee["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [54]:
# your answer here
employee["Salary"].max()

70

#### What's the lowest salary?

In [55]:
# your answer here
employee["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [57]:
# your answer here
low = employee["Salary"] == employee["Salary"].min()
employee[low]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Could you give all the information about an employee called David?

In [59]:
# your answer here
David = employee["Name"] == "David"
employee[David]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you give only David's salary?

In [64]:
# your answer here
employee[David]["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate

In [74]:
# your answer here
employee[employee["Title"] == "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [75]:
# your answer here- 1 method
employee.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [80]:
# your answer here- 2nd method
print(employee.iloc[:3])

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees who's title is associate and the salary above 55?

In [83]:
# your answer here
assoc = employee["Title"] == "associate"
salary = employee["Salary"] > 55
employee[assoc & salary]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [84]:
# your answer here
employee.groupby("Years").agg("mean")

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average Salary per title?

In [85]:
# your answer here
employee.groupby("Title").agg("mean")

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
##### - `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [ ]:
# draw boxplot here

In [ ]:
# print first quartile here

In [ ]:
# print third quartile here

#### Is the mean salary per gender different?

In [ ]:
# your answer here

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [ ]:
# your answer here

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [ ]:
# your answer here

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

In [ ]:
# your answer here

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [ ]:
# your answer here

In [ ]:
# your answer here

####  What is the average Purchase Price?

In [ ]:
# your answer here

#### What were the highest and lowest purchase prices?

In [ ]:
# your answer here

In [ ]:
# your answer here

#### Select all the customers we have in Spain

In [ ]:
# your answer here

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [ ]:
# your answer here

#### Select all the customers who have bought more than 50 items ?

In [ ]:
# your answer here

#### Select orders from Spain that are above 50 items

In [ ]:
# your answer here

#### Select all free orders

In [ ]:
# your answer here

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [ ]:
# your answer here

#### Select all orders that are made in 2011 and are 'lunch bag'

In [ ]:
# your answer here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your answer here

#### Select all orders made in the month of August

In [ ]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [ ]:
# your answer here

#### What's the  average amount of money spent by country

In [ ]:
# your answer here

#### What's the most expensive item?

In [ ]:
# your answer here

#### What was the average amount spent per year ?

In [ ]:
# your answer here